import { Action, Ctx, Update } from 'nestjs-telegraf';
import { Context, Markup } from 'telegraf';

@Update()
export class AboutHandler {
  @Action('ab')
  async handleAboutBot(@Ctx() ctx: Context) {
    const message = `
🎓 <b>عن بوت ملازم كلية الحاسبات</b>

📚 <b>بوت ملازم كلية الحاسبات – جامعة سيئون</b>

هو مبادرة طلابية تهدف إلى جمع وتنظيم الملازم والمحاضرات والاختبارات والمصادر الدراسية في مكان واحد، لتسهيل وصول الطلاب إليها والاستفادة منها.

📖 <b>ماذا يقدم البوت؟</b>

• 📚 ملازم ومحاضرات المقررات النظرية والتطبيقية.
• 📝 نماذج واختبارات السنوات السابقة.
• 🗂️ تنظيم المحتوى حسب التخصص والمستوى والمقرر.
• 🔄 تحديث المحتوى وإضافة المصادر بشكل مستمر.

💡 <b>مبادرة طلابية</b>

تم إنشاء وبرمجة هذا المشروع كمبادرة طلابية من طلاب أمن المعلومات، بهدف خدمة طلاب وطالبات كلية الحاسبات وتسهيل الوصول إلى المحتوى والمصادر الدراسية.

🧑‍💻 <b>المشروع مفتوح المصدر</b>

السورس كود متاح للجميع للاطلاع والمساهمة والتطوير:

🔗 <a href="https://github.com/sheba101/cs-resource-hub">GitHub</a>

🤝 إذا كان لديك ملازم أو اختبارات أو مصادر دراسية وترغب في إضافتها، يمكنك التواصل مع إدارة المشروع للمساهمة في إثراء المكتبة.

📢 <b>بوت ملازم كلية الحاسبات – جامعة سيئون</b>
@CS_College_Bot
`;

    await ctx.editMessageText(message, {
      parse_mode: 'HTML',
      ...Markup.inlineKeyboard([
        [Markup.button.callback('🔙 العودة للقائمة الرئيسية', 'main_menu')],
      ]),
    });

    await ctx.answerCbQuery();
  }
}
